constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    wall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          2898;
        startFace       22584;
    }
    inlet
    {
        type            patch;
        nFaces          6;
        startFace       25482;
    }
    outlet
    {
        type            patch;
        nFaces          6;
        startFace       25488;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          24084;
        startFace       25494;
    }
)

// ************************************************************************* //
